In [ ]:
import pandas as pd
import numpy as np

In [2]:
#Create 3 differents Series, each of length 100, as follows:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100,
dtype='l'))
print(s1, s2, s3)

0     1
1     4
2     4
3     2
4     1
     ..
95    3
96    2
97    2
98    4
99    3
Length: 100, dtype: int32 0     1
1     3
2     1
3     3
4     3
     ..
95    3
96    1
97    3
98    2
99    1
Length: 100, dtype: int32 0     28619
1     25452
2     21449
3     29370
4     27616
      ...
95    23685
96    21921
97    26846
98    16757
99    15169
Length: 100, dtype: int32

In [3]:
#Let's create a DataFrame by joinning the Series by column
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  1  1  28619
1  4  3  25452
2  4  1  21449
3  2  3  29370
4  1  3  27616

In [4]:
#Change the name of the columns to bedrs, bathrs,price_sqr_meter
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2:
'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            28619
1      4       3            25452
2      4       1            21449
3      2       3            29370
4      1       3            27616

In [5]:
#Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)
# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

<class 'pandas.core.frame.DataFrame'>

In [6]:
#Oops, it seems it is going only until index 99. Is it true?
# no the index are kept but the length of the DataFrame is 300
len(bigcolumn)

300

In [7]:
#Reindex the DataFrame so it goes from 0 to 299
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        4
2        4
3        2
4        1
..     ...
295  23685
296  21921
297  26846
298  16757
299  15169

[300 rows x 1 columns]